{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "192"}]}}}, "outputs": {"output_1": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_1/policy_head_dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/policy_logits_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/initial_dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_dense1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_dense2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/ArithmeticOptimizer/ReplaceMulWithBroadcastByTile_Const_mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_dense1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_dense2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/ArithmeticOptimizer/ReplaceMulWithBroadcastByTile_Const_mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_dense1_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_dense2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/ArithmeticOptimizer/ReplaceMulWithBroadcastByTile_Const_mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/value_head_dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/value_output_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "192"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/initial_dense_1/MatMul", "op": "MatMul", "input": ["inputs", "StatefulPartitionedCall/functional_1/initial_dense_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/initial_dense_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/initial_dense_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_dense1_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_1/initial_dense_1/Relu", "StatefulPartitionedCall/functional_1/res_block_0_dense1_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_dense1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/res_block_0_dense1_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_dense2_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_1/res_block_0_dense1_1/Relu", "StatefulPartitionedCall/functional_1/res_block_0_dense2_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_dense2_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/res_block_0_dense2_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_add_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/initial_dense_1/Relu", "StatefulPartitionedCall/functional_1/res_block_0_dense2_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/functional_1/res_block_0_add_1/Add", "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/functional_1/res_block_0_add_1/Add", "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/moments/SquaredDifference", "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/moments/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/moments/variance", "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/ArithmeticOptimizer/ReplaceMulWithBroadcastByTile_Tile_mul", "op": "Tile", "input": ["StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/Rsqrt", "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/ArithmeticOptimizer/ReplaceMulWithBroadcastByTile_Const_mul"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/Neg", "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/ArithmeticOptimizer/ReplaceMulWithBroadcastByTile_Tile_mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/res_block_0_add_1/Add", "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/ArithmeticOptimizer/ReplaceMulWithBroadcastByTile_Tile_mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/mul_2", "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_dense1_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/add_2", "StatefulPartitionedCall/functional_1/res_block_1_dense1_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_dense1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/res_block_1_dense1_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_dense2_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_1/res_block_1_dense1_1/Relu", "StatefulPartitionedCall/functional_1/res_block_1_dense2_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_dense2_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/res_block_1_dense2_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_add_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/add_2", "StatefulPartitionedCall/functional_1/res_block_1_dense2_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/functional_1/res_block_1_add_1/Add", "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/functional_1/res_block_1_add_1/Add", "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/moments/SquaredDifference", "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/moments/variance/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/moments/variance", "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/ArithmeticOptimizer/ReplaceMulWithBroadcastByTile_Tile_mul", "op": "Tile", "input": ["StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/Rsqrt", "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/ArithmeticOptimizer/ReplaceMulWithBroadcastByTile_Const_mul"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/Neg", "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/ArithmeticOptimizer/ReplaceMulWithBroadcastByTile_Tile_mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/res_block_1_add_1/Add", "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/ArithmeticOptimizer/ReplaceMulWithBroadcastByTile_Tile_mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/mul_2", "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_dense1_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/add_2", "StatefulPartitionedCall/functional_1/res_block_2_dense1_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_dense1_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/res_block_2_dense1_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_dense2_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_1/res_block_2_dense1_1/Relu", "StatefulPartitionedCall/functional_1/res_block_2_dense2_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_dense2_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/res_block_2_dense2_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_add_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/add_2", "StatefulPartitionedCall/functional_1/res_block_2_dense2_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/functional_1/res_block_2_add_1/Add", "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/functional_1/res_block_2_add_1/Add", "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/moments/SquaredDifference", "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/moments/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/moments/variance", "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/ArithmeticOptimizer/ReplaceMulWithBroadcastByTile_Tile_mul", "op": "Tile", "input": ["StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/Rsqrt", "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/ArithmeticOptimizer/ReplaceMulWithBroadcastByTile_Const_mul"], "attr": {"T": {"type": "DT_FLOAT"}, "Tmultiples": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/Neg", "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/ArithmeticOptimizer/ReplaceMulWithBroadcastByTile_Tile_mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/res_block_2_add_1/Add", "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/ArithmeticOptimizer/ReplaceMulWithBroadcastByTile_Tile_mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/mul_2", "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/policy_head_dense_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/add_2", "StatefulPartitionedCall/functional_1/policy_head_dense_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"grad_a": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/value_head_dense_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/add_2", "StatefulPartitionedCall/functional_1/value_head_dense_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/policy_head_dense_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/policy_head_dense_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/value_head_dense_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/value_head_dense_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/policy_logits_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_1/policy_head_dense_1/Relu", "StatefulPartitionedCall/functional_1/policy_logits_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/value_output_1/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/functional_1/value_head_dense_1/Relu", "StatefulPartitionedCall/functional_1/value_output_1/Cast/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/policy_output_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_1/policy_logits_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/value_output_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/functional_1/value_output_1/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_1/policy_output_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["StatefulPartitionedCall/functional_1/value_output_1/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_1/policy_head_dense_1/Cast/ReadVariableOp", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/policy_logits_1/Cast/ReadVariableOp", "shape": [64, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/initial_dense_1/Cast/ReadVariableOp", "shape": [192, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_dense1_1/Cast/ReadVariableOp", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_dense2_1/Cast/ReadVariableOp", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/moments/mean/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/moments/variance/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/add/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/res_block_0_layernorm_1/ArithmeticOptimizer/ReplaceMulWithBroadcastByTile_Const_mul", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_dense1_1/Cast/ReadVariableOp", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_dense2_1/Cast/ReadVariableOp", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/moments/mean/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/moments/variance/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/add/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/res_block_1_layernorm_1/ArithmeticOptimizer/ReplaceMulWithBroadcastByTile_Const_mul", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_dense1_1/Cast/ReadVariableOp", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_dense2_1/Cast/ReadVariableOp", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/moments/mean/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/moments/variance/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/add/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/res_block_2_layernorm_1/ArithmeticOptimizer/ReplaceMulWithBroadcastByTile_Const_mul", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/value_head_dense_1/Cast/ReadVariableOp", "shape": [64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/value_output_1/Cast/ReadVariableOp", "shape": [32, 1], "dtype": "float32"}]}]}