{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "6"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_1/lambda_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lambda_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lambda_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/lambda_2_1/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lambda_1_2/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lambda_1_2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/lambda_1_2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/concatenate_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "33"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_3_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_3_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_4_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_4_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "6"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/lambda_1/strided_slice", "op": "StridedSlice", "input": ["inputs", "StatefulPartitionedCall/functional_1/lambda_1/strided_slice/stack", "StatefulPartitionedCall/functional_1/lambda_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_1/lambda_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/lambda_1_2/strided_slice", "op": "StridedSlice", "input": ["inputs", "StatefulPartitionedCall/functional_1/lambda_1_2/strided_slice/stack", "StatefulPartitionedCall/functional_1/lambda_1_2/strided_slice/stack_1", "StatefulPartitionedCall/functional_1/lambda_1_2/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "3"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/lambda_2_1/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/lambda_1/strided_slice", "ConstantFolding/StatefulPartitionedCall/functional_1/lambda_2_1/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1/lambda_2_1/truediv", "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-4"}, {"size": "5"}]}, {"dim": [{"size": "5"}, {"size": "64"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1/dense_1/Relu", "StatefulPartitionedCall/functional_1/dense_1_2/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-4"}, {"size": "64"}]}, {"dim": [{"size": "64"}, {"size": "32"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/concatenate_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_1/dense_1_2/Relu", "StatefulPartitionedCall/functional_1/lambda_1_2/strided_slice", "StatefulPartitionedCall/functional_1/concatenate_1/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1/concatenate_1/concat", "StatefulPartitionedCall/functional_1/dense_2_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-4"}, {"size": "33"}]}, {"dim": [{"size": "33"}, {"size": "64"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_3_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1/dense_2_1/Relu", "StatefulPartitionedCall/functional_1/dense_3_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_1/dense_3_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-4"}, {"size": "64"}]}, {"dim": [{"size": "64"}, {"size": "32"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_4_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_1/dense_3_1/Relu", "StatefulPartitionedCall/functional_1/dense_4_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_1/dense_4_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-4"}, {"size": "32"}]}, {"dim": [{"size": "32"}, {"size": "256"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_1/dense_4_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_1/lambda_1/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lambda_1/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lambda_1/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_1/lambda_2_1/truediv_recip", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp", "shape": [5, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/Cast/ReadVariableOp", "shape": [64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/lambda_1_2/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lambda_1_2/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/lambda_1_2/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/concatenate_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/Cast/ReadVariableOp", "shape": [33, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_3_1/Cast/ReadVariableOp", "shape": [64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_3_1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_4_1/Cast/ReadVariableOp", "shape": [32, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_1/dense_4_1/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}]}]}