{"format": "layers-model", "generatedBy": "keras v3.9.2", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.9.2", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 6], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer"}, "name": "input_layer", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "function": {"class_name": "__lambda__", "config": {"code": "4wEAAAAAAAAAAAAAAAQAAAATAAAA8x4AAACXAHwAZABkAIUCZABkAYUCZgIZAAAAAAAAAAAAUwAp\nAk7pBQAAAKkAqQHaAXhzAQAAACD6MC9ob21lL2pvaG4vY29kZS92aWJlLWNvZGUtc29ubmV0My43\nL2Rxbl9hZ2VudC5wefoIPGxhbWJkYT76J0RRTkFnZW50Ll9idWlsZF9tb2RlbC48bG9jYWxzPi48\nbGFtYmRhPlAAAABzFgAAAIAAsAGwIbAhsCGwUrBhsFKwJbQIgADzAAAAAA==\n", "defaults": null, "closure": null}}, "arguments": {}}, "name": "lambda", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 6], "dtype": "float32", "keras_history": ["input_layer", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 5], "dtype": "float32", "keras_history": ["lambda", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float32", "keras_history": ["dense", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "function": {"class_name": "__lambda__", "config": {"code": "4wEAAAAAAAAAAAAAAAQAAAATAAAA8x4AAACXAHwAZABkAIUCZAFkAIUCZgIZAAAAAAAAAAAAUwAp\nAk7p/////6kAqQHaAXhzAQAAACD6MC9ob21lL2pvaG4vY29kZS92aWJlLWNvZGUtc29ubmV0My43\nL2Rxbl9hZ2VudC5wefoIPGxhbWJkYT76J0RRTkFnZW50Ll9idWlsZF9tb2RlbC48bG9jYWxzPi48\nbGFtYmRhPlMAAABzFgAAAIAAqHGwEbARsBGwQrBDsEOwFqx5gADzAAAAAA==\n", "defaults": null, "closure": null}}, "arguments": {}}, "name": "lambda_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 6], "dtype": "float32", "keras_history": ["input_layer", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1}, "name": "concatenate", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["dense_1", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["lambda_1", 0, 0]}}]], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 129], "dtype": "float32", "keras_history": ["concatenate", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float32", "keras_history": ["dense_2", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_4", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["dense_3", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["input_layer", 0, 0]], "output_layers": [["dense_4", 0, 0]]}}, "training_config": {"loss": "mse", "loss_weights": null, "metrics": null, "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": 1.0, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense/kernel", "shape": [5, 256], "dtype": "float32"}, {"name": "dense/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [129, 256], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [128, 256], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [256], "dtype": "float32"}]}]}